-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: peekpick-db.cxl5ipdf2trc.ap-northeast-2.rds.amazonaws.com    Database: peekpick_db
-- ------------------------------------------------------
-- Server version	8.0.33

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ '';

--
-- Table structure for table `category`
--

DROP TABLE IF EXISTS `category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `category` (
  `category_id` bigint NOT NULL AUTO_INCREMENT,
  `large` varchar(255) DEFAULT NULL,
  `middle` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`category_id`)
) ENGINE=InnoDB AUTO_INCREMENT=180 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `category`
--

LOCK TABLES `category` WRITE;
/*!40000 ALTER TABLE `category` DISABLE KEYS */;
INSERT INTO `category` VALUES (1,'음악','록'),(2,'음악','클래식'),(3,'음악','재즈'),(4,'음악','힙합'),(5,'음악','R&B'),(6,'음악','케이팝'),(7,'음악','인디음악'),(8,'음악','레게'),(9,'음악','펑크'),(10,'음악','블루스'),(11,'음악','소울'),(12,'음악','테크노'),(13,'음악','EDM'),(14,'음악','컨트리'),(15,'음악','라틴'),(16,'음악','메탈'),(17,'음악','게임 음악'),(18,'음악','영화 OST'),(19,'음악','뉴에이지'),(20,'음식','피자'),(21,'음식','파스타'),(22,'음식','초밥'),(23,'음식','라멘'),(24,'음식','스테이크'),(25,'음식','햄버거'),(26,'음식','타코'),(27,'음식','샐러드'),(28,'음식','고수'),(29,'음식','파이'),(30,'음식','카레'),(31,'음식','돈까스'),(32,'음식','민트초코'),(33,'음식','바비큐'),(34,'음식','가지'),(35,'음식','샌드위치'),(36,'음식','초콜릿'),(37,'음식','치킨'),(38,'음식','딸기'),(39,'음식','케이크'),(40,'영화','액션'),(41,'영화','코미디'),(42,'영화','드라마'),(43,'영화','공포'),(44,'영화','스릴러'),(45,'영화','로맨스'),(46,'영화','SF'),(47,'영화','판타지'),(48,'영화','애니메이션'),(49,'영화','서부영화'),(50,'영화','뮤지컬'),(51,'영화','다큐멘터리'),(52,'영화','미스터리'),(53,'영화','전쟁'),(54,'영화','범죄'),(55,'영화','청춘'),(56,'영화','느와르'),(57,'영화','사극'),(58,'영화','스포츠'),(59,'영화','바이오픽'),(60,'스포츠','축구'),(61,'스포츠','농구'),(62,'스포츠','야구'),(63,'스포츠','테니스'),(64,'스포츠','볼링'),(65,'스포츠','럭비'),(66,'스포츠','수영'),(67,'스포츠','스케이트보드'),(68,'스포츠','스노보드'),(69,'스포츠','스쿼시'),(70,'스포츠','등산'),(71,'스포츠','사이클링'),(72,'스포츠','요가'),(73,'스포츠','무술'),(74,'스포츠','배드민턴'),(75,'스포츠','복싱'),(76,'스포츠','승마'),(77,'스포츠','스쿼시'),(78,'스포츠','하키'),(79,'스포츠','골프'),(80,'여행지','파리'),(81,'여행지','런던'),(82,'여행지','뉴욕'),(83,'여행지','도쿄'),(84,'여행지','시드니'),(85,'여행지','로마'),(86,'여행지','아이슬란드'),(87,'여행지','케이프타운'),(88,'여행지','리우데자네이로'),(89,'여행지','카이로'),(90,'여행지','베이징'),(91,'여행지','키요토'),(92,'여행지','말리부'),(93,'여행지','바르셀로나'),(94,'여행지','베를린'),(95,'여행지','상파울루'),(96,'여행지','델리'),(97,'여행지','코펜하겐'),(98,'여행지','멕시코시티'),(99,'여행지','마드리드'),(100,'패션','빈티지'),(101,'패션','스트릿웨어'),(102,'패션','스마트 캐주얼'),(103,'패션','럭셔리'),(104,'패션','미니멀리스트'),(105,'패션','펑크'),(106,'패션','그런지'),(107,'패션','아슬레저'),(108,'패션','고딕'),(109,'패션','유니섹스'),(110,'패션','유럽 전통'),(111,'패션','보헤미안'),(112,'패션','비즈니스 캐주얼'),(113,'패션','웨스턴'),(114,'패션','하이패션'),(115,'패션','프레피'),(116,'패션','로맨틱'),(117,'패션','팝아트'),(118,'패션','코티지코어'),(119,'패션','테크웨어'),(120,'동물','강아지'),(121,'동물','고양이'),(122,'동물','햄스터'),(123,'동물','토끼'),(124,'동물','파랑새'),(125,'동물','금붕어'),(126,'동물','거북이'),(127,'동물','뱀'),(128,'동물','도마뱀'),(129,'동물','유리늑대'),(130,'동물','염소'),(131,'동물','닭'),(132,'동물','오리'),(133,'동물','선새'),(134,'동물','이구아나'),(135,'동물','페럿'),(136,'동물','슈가 글라이더'),(137,'동물','헤지혹'),(138,'동물','타란튤라'),(139,'동물','식충식물'),(140,'책','판타지'),(141,'책','공상과학(SF)'),(142,'책','미스터리'),(143,'책','로맨스'),(144,'책','공포'),(145,'책','드라마'),(146,'책','유머'),(147,'책','역사'),(148,'책','전기'),(149,'책','유아'),(150,'책','요리'),(151,'책','건강'),(152,'책','자기계발'),(153,'책','여행'),(154,'책','예술'),(155,'책','디자인'),(156,'책','비즈니스'),(157,'책','피트니스'),(158,'책','라이프스타일'),(159,'책','테크'),(160,'게임','액션'),(161,'게임','어드벤처'),(162,'게임','롤플레잉'),(163,'게임','슈팅'),(164,'게임','전략'),(165,'게임','시뮬레이션'),(166,'게임','퍼즐'),(167,'게임','스포츠'),(168,'게임','인디'),(169,'게임','대전 격투'),(170,'게임','플랫폼'),(171,'게임','레이싱'),(172,'게임','음악'),(173,'게임','하이퍼 캐주얼'),(174,'게임','카지노'),(175,'게임','보드 게임'),(176,'게임','카드 게임'),(177,'게임','테이블 게임'),(178,'게임','VR 게임'),(179,'게임','MOBA');
/*!40000 ALTER TABLE `category` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-08-18  8:05:52
